mixly/SMeshStudio/smeshcore/hardware/contiki/boards.txt
# See: http://www.smeshlink.com
##############################################################
iduinormini.name=contiki_iduinormini_r2
iduinormini.cpu=atmega128rfa1

iduinormini.upload.tool=avrdude
iduinormini.upload.protocol=arduino
iduinormini.upload.maximum_size=126976
iduinormini.upload.speed=57600

iduinormini.bootloader.tool=avrdude
iduinormini.bootloader.low_fuses=0xFF
iduinormini.bootloader.high_fuses=0xDA
iduinormini.bootloader.extended_fuses=0xF5
iduinormini.bootloader.file=atmega/ATmegaBOOT_atmega128rfa1_16M.hex
iduinormini.bootloader.unlock_bits=0x3F
iduinormini.bootloader.lock_bits=0x0F

iduinormini.build.mcu=atmega128rfa1
iduinormini.build.f_cpu=16000000L
iduinormini.build.core=contiki
iduinormini.build.variant=iduino
iduinormini.compiler.path={runtime.ide.path}/tools/avr/bin/
iduinormini.compiler.c.cmd=avr-gcc
iduinormini.compiler.c.flags=-c -g -Os -w -ffunction-sections -fdata-sections -MMD -gdwarf-2 -fno-strict-aliasing  
iduinormini.compiler.c.elf.flags=-Os -Wl,--gc-sections
iduinormini.compiler.c.elf.cmd=avr-gcc
iduinormini.compiler.S.flags=-c -g -assembler-with-cpp
iduinormini.compiler.cpp.cmd=avr-g++
iduinormini.compiler.cpp.flags=-c -g -Os -w -fno-exceptions -ffunction-sections -fdata-sections -MMD  -std=gnu++98  
iduinormini.compiler.ar.cmd=avr-ar
iduinormini.compiler.ar.flags=rcs
iduinormini.compiler.objcopy.cmd=avr-objcopy
iduinormini.compiler.objcopy.eep.flags=-O ihex -j .eeprom --set-section-flags=.eeprom=alloc,load --no-change-warnings --change-section-lma .eeprom=0
iduinormini.compiler.elf2hex.flags=-O ihex -R .eeprom -j .text -j .data
iduinormini.compiler.elf2hex.cmd=avr-objcopy
iduinormini.compiler.ldflags=
iduinormini.compiler.size.cmd=avr-size
iduinormini.recipe.c.o.pattern="{compiler.path}{compiler.c.cmd}" {compiler.c.flags} -mmcu={build.mcu} -DF_CPU={build.f_cpu} -DARDUINO={runtime.ide.version} -DARDUINO_{build.board} -DARDUINO_ARCH_{build.arch}  {build.extra_flags} {includes} "{source_file}" -o "{object_file}"
iduinormini.recipe.cpp.o.pattern="{compiler.path}{compiler.cpp.cmd}" {compiler.cpp.flags} -mmcu={build.mcu} -DF_CPU={build.f_cpu} -DARDUINO={runtime.ide.version} -DARDUINO_{build.board} -DARDUINO_ARCH_{build.arch}  {build.extra_flags} {includes} "{source_file}" -o "{object_file}"
iduinormini.recipe.ar.pattern="{compiler.path}{compiler.ar.cmd}" {compiler.ar.flags} "{build.path}/{archive_file}" "{object_file}"
iduinormini.recipe.c.combine.pattern="{compiler.path}{compiler.c.elf.cmd}" {compiler.c.elf.flags} -mmcu={build.mcu} -o "{build.path}/{build.project_name}.elf" {object_files} "{build.path}/{archive_file}" "-L{build.path}" -lm
iduinormini.recipe.objcopy.eep.pattern="{compiler.path}{compiler.objcopy.cmd}" {compiler.objcopy.eep.flags} "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.eep"
iduinormini.recipe.objcopy.hex.pattern="{compiler.path}{compiler.elf2hex.cmd}" {compiler.elf2hex.flags} "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
iduinormini.recipe.size.pattern="{compiler.path}{compiler.size.cmd}" --format=avr --mcu={build.mcu} "{build.path}/{build.project_name}.elf"
iduinormini.recipe.size.regex=^(?:\.text|\.data|\.bootloader)\s+([0-9]+).*
iduinormini.recipe.size.regex.data=^(?:\.data|\.bss|\.noinit)\s+([0-9]+).*
iduinormini.recipe.size.regex.eeprom=^(?:\.eeprom)\s+([0-9]+).*
iduinormini.build.extra_flags=-DHAVE_STDINT_H -DRF230BB=1 -DUIP_CONF_IPV6=1 -DWATCHDOG_CONF_TIMEOUT=WDTO_8S -DAUTO_CRC_PADDING=2 -DAUTOSTART_ENABLE=1 -DPROJECT_CONF_H=\"project-conf.h\" -DCONTIKI=1 -DRS232_CONF_NUMPORTS=2 
##############################################################
mx2xxcc.name=contiki_mx2xxcc
mx2xxcc.cpu=atmega1284p

mx2xxcc.upload.tool=avrdude
mx2xxcc.upload.protocol=arduino
mx2xxcc.upload.maximum_size=129024
mx2xxcc.upload.speed=38400

mx2xxcc.bootloader.tool=avrdude
mx2xxcc.bootloader.low_fuses=0xE2
mx2xxcc.bootloader.high_fuses=0x9A
mx2xxcc.bootloader.extended_fuses=0xFF
mx2xxcc.bootloader.file=atmega/ATmegaBOOT_atmega1284p_8M.hex
mx2xxcc.bootloader.unlock_bits=0x3F
mx2xxcc.bootloader.lock_bits=0x0F

mx2xxcc.build.mcu=atmega1284p
mx2xxcc.build.f_cpu=8000000L
mx2xxcc.build.core=contiki
mx2xxcc.build.variant=mx2xxcc
mx2xxcc.compiler.path={runtime.ide.path}/tools/avr/bin/
mx2xxcc.compiler.c.cmd=avr-gcc
mx2xxcc.compiler.c.flags=-c -g -Os -w -ffunction-sections -fdata-sections -MMD -gdwarf-2 -fno-strict-aliasing  
mx2xxcc.compiler.c.elf.flags=-Os -Wl,--gc-sections
mx2xxcc.compiler.c.elf.cmd=avr-gcc
mx2xxcc.compiler.S.flags=-c -g -assembler-with-cpp
mx2xxcc.compiler.cpp.cmd=avr-g++
mx2xxcc.compiler.cpp.flags=-c -g -Os -w -fno-exceptions -ffunction-sections -fdata-sections -MMD  -std=gnu++98  
mx2xxcc.compiler.ar.cmd=avr-ar
mx2xxcc.compiler.ar.flags=rcs
mx2xxcc.compiler.objcopy.cmd=avr-objcopy
mx2xxcc.compiler.objcopy.eep.flags=-O ihex -j .eeprom --set-section-flags=.eeprom=alloc,load --no-change-warnings --change-section-lma .eeprom=0
mx2xxcc.compiler.elf2hex.flags=-O ihex -R .eeprom -j .text -j .data
mx2xxcc.compiler.elf2hex.cmd=avr-objcopy
mx2xxcc.compiler.ldflags=
mx2xxcc.compiler.size.cmd=avr-size
mx2xxcc.recipe.c.o.pattern="{compiler.path}{compiler.c.cmd}" {compiler.c.flags} -mmcu={build.mcu} -DF_CPU={build.f_cpu} -DARDUINO={runtime.ide.version} -DARDUINO_{build.board} -DARDUINO_ARCH_{build.arch}  {build.extra_flags} {includes} "{source_file}" -o "{object_file}"
mx2xxcc.recipe.cpp.o.pattern="{compiler.path}{compiler.cpp.cmd}" {compiler.cpp.flags} -mmcu={build.mcu} -DF_CPU={build.f_cpu} -DARDUINO={runtime.ide.version} -DARDUINO_{build.board} -DARDUINO_ARCH_{build.arch}  {build.extra_flags} {includes} "{source_file}" -o "{object_file}"
mx2xxcc.recipe.ar.pattern="{compiler.path}{compiler.ar.cmd}" {compiler.ar.flags} "{build.path}/{archive_file}" "{object_file}"
mx2xxcc.recipe.c.combine.pattern="{compiler.path}{compiler.c.elf.cmd}" {compiler.c.elf.flags} -mmcu={build.mcu} -o "{build.path}/{build.project_name}.elf" {object_files} "{build.path}/{archive_file}" "-L{build.path}" -lm
mx2xxcc.recipe.objcopy.eep.pattern="{compiler.path}{compiler.objcopy.cmd}" {compiler.objcopy.eep.flags} "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.eep"
mx2xxcc.recipe.objcopy.hex.pattern="{compiler.path}{compiler.elf2hex.cmd}" {compiler.elf2hex.flags} "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mx2xxcc.recipe.size.pattern="{compiler.path}{compiler.size.cmd}" --format=avr --mcu={build.mcu} "{build.path}/{build.project_name}.elf"
mx2xxcc.recipe.size.regex=^(?:\.text|\.data|\.bootloader)\s+([0-9]+).*
mx2xxcc.recipe.size.regex.data=^(?:\.data|\.bss|\.noinit)\s+([0-9]+).*
mx2xxcc.recipe.size.regex.eeprom=^(?:\.eeprom)\s+([0-9]+).*
mx2xxcc.build.extra_flags=-DHAVE_STDINT_H -DRF230BB=1 -DUIP_CONF_IPV6=1 -DWATCHDOG_CONF_TIMEOUT=WDTO_8S -DAUTO_CRC_PADDING=2 -DAUTOSTART_ENABLE=1 -DPROJECT_CONF_H=\"project-conf.h\" -DCONTIKI=1  -DRS232_CONF_NUMPORTS=2
##############################################################
mxseabo.name=contiki_mxseabo_8M
mxseabo.cpu=atmega1284p

mxseabo.upload.tool=avrdude
mxseabo.upload.protocol=arduino
mxseabo.upload.maximum_size=129024
mxseabo.upload.speed=38400

mxseabo.bootloader.tool=avrdude
mxseabo.bootloader.low_fuses=0xE2
mxseabo.bootloader.high_fuses=0x9A
mxseabo.bootloader.extended_fuses=0xFF
mxseabo.bootloader.file=atmega/ATmegaBOOT_atmega1284p_8M.hex
mxseabo.bootloader.unlock_bits=0x3F
mxseabo.bootloader.lock_bits=0x0F

mxseabo.build.mcu=atmega1284p
mxseabo.build.f_cpu=8000000L
mxseabo.build.core=contiki
mxseabo.build.variant=mxseabo
mxseabo.compiler.path={runtime.ide.path}/tools/avr/bin/
mxseabo.compiler.c.cmd=avr-gcc
mxseabo.compiler.c.flags=-c -g -Os -w -ffunction-sections -fdata-sections -MMD -gdwarf-2 -fno-strict-aliasing  
mxseabo.compiler.c.elf.flags=-Os -Wl,--gc-sections
mxseabo.compiler.c.elf.cmd=avr-gcc
mxseabo.compiler.S.flags=-c -g -assembler-with-cpp
mxseabo.compiler.cpp.cmd=avr-g++
mxseabo.compiler.cpp.flags=-c -g -Os -w -fno-exceptions -ffunction-sections -fdata-sections -MMD  -std=gnu++98  
mxseabo.compiler.ar.cmd=avr-ar
mxseabo.compiler.ar.flags=rcs
mxseabo.compiler.objcopy.cmd=avr-objcopy
mxseabo.compiler.objcopy.eep.flags=-O ihex -j .eeprom --set-section-flags=.eeprom=alloc,load --no-change-warnings --change-section-lma .eeprom=0
mxseabo.compiler.elf2hex.flags=-O ihex -R .eeprom -j .text -j .data
mxseabo.compiler.elf2hex.cmd=avr-objcopy
mxseabo.compiler.ldflags=
mxseabo.compiler.size.cmd=avr-size
mxseabo.recipe.c.o.pattern="{compiler.path}{compiler.c.cmd}" {compiler.c.flags} -mmcu={build.mcu} -DF_CPU={build.f_cpu} -DARDUINO={runtime.ide.version} -DARDUINO_{build.board} -DARDUINO_ARCH_{build.arch}  {build.extra_flags} {includes} "{source_file}" -o "{object_file}"
mxseabo.recipe.cpp.o.pattern="{compiler.path}{compiler.cpp.cmd}" {compiler.cpp.flags} -mmcu={build.mcu} -DF_CPU={build.f_cpu} -DARDUINO={runtime.ide.version} -DARDUINO_{build.board} -DARDUINO_ARCH_{build.arch}  {build.extra_flags} {includes} "{source_file}" -o "{object_file}"
mxseabo.recipe.ar.pattern="{compiler.path}{compiler.ar.cmd}" {compiler.ar.flags} "{build.path}/{archive_file}" "{object_file}"
mxseabo.recipe.c.combine.pattern="{compiler.path}{compiler.c.elf.cmd}" {compiler.c.elf.flags} -mmcu={build.mcu} -o "{build.path}/{build.project_name}.elf" {object_files} "{build.path}/{archive_file}" "-L{build.path}" -lm
mxseabo.recipe.objcopy.eep.pattern="{compiler.path}{compiler.objcopy.cmd}" {compiler.objcopy.eep.flags} "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.eep"
mxseabo.recipe.objcopy.hex.pattern="{compiler.path}{compiler.elf2hex.cmd}" {compiler.elf2hex.flags} "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mxseabo.recipe.size.pattern="{compiler.path}{compiler.size.cmd}" --format=avr --mcu={build.mcu} "{build.path}/{build.project_name}.elf"
mxseabo.recipe.size.regex=^(?:\.text|\.data|\.bootloader)\s+([0-9]+).*
mxseabo.recipe.size.regex.data=^(?:\.data|\.bss|\.noinit)\s+([0-9]+).*
mxseabo.recipe.size.regex.eeprom=^(?:\.eeprom)\s+([0-9]+).*
mxseabo.build.extra_flags=-DHAVE_STDINT_H -DRF230BB=1 -DUIP_CONF_IPV6=1 -DWATCHDOG_CONF_TIMEOUT=WDTO_8S -DAUTO_CRC_PADDING=2 -DAUTOSTART_ENABLE=1 -DPROJECT_CONF_H=\"project-conf.h\" -DCONTIKI=1  -DRS232_CONF_NUMPORTS=2
##############################################################
#mxusbstick.name=contiki_mxusbstick
#mxusbstick.cpu=atmega128rfa1

#mxusbstick.upload.tool=avrdude
#mxusbstick.upload.protocol=arduino
#mxusbstick.upload.maximum_size=126976
#mxusbstick.upload.speed=57600

#mxusbstick.bootloader.tool=avrdude
#mxusbstick.bootloader.low_fuses=0xFF
#mxusbstick.bootloader.high_fuses=0xDA
#mxusbstick.bootloader.extended_fuses=0xF5
#mxusbstick.bootloader.file=atmega/ATmegaBOOT_atmega128rfa1_16M.hex
#mxusbstick.bootloader.unlock_bits=0x3F
#mxusbstick.bootloader.lock_bits=0x0F

#mxusbstick.build.mcu=at90usb1287
#mxusbstick.build.f_cpu=8000000L
#mxusbstick.build.core=contiki
#mxusbstick.build.variant=mxusbstick
#mxusbstick.compiler.path={runtime.ide.path}/tools/avr/bin/
#mxusbstick.compiler.c.cmd=avr-gcc
#mxusbstick.compiler.c.flags=-c -g -Os -w -ffunction-sections -fdata-sections -MMD -gdwarf-2 -fno-strict-aliasing  
#mxusbstick.compiler.c.elf.flags=-Os -Wl,--gc-sections
#mxusbstick.compiler.c.elf.cmd=avr-gcc
#mxusbstick.compiler.S.flags=-c -g -assembler-with-cpp
#mxusbstick.compiler.cpp.cmd=avr-g++
#mxusbstick.compiler.cpp.flags=-c -g -Os -w -fno-exceptions -ffunction-sections -fdata-sections -MMD  -std=gnu++98  
##mxusbstick.compiler.ar.cmd=avr-ar
#mxusbstick.compiler.ar.flags=rcs
#mxusbstick.compiler.objcopy.cmd=avr-objcopy
#mxusbstick.compiler.objcopy.eep.flags=-O ihex -j .eeprom --set-section-flags=.eeprom=alloc,load --no-change-warnings --change-section-lma .eeprom=0
#mxusbstick.compiler.elf2hex.flags=-O ihex -R .eeprom -j .text -j .data
#mxusbstick.compiler.elf2hex.cmd=avr-objcopy
#mxusbstick.compiler.ldflags=
#mxusbstick.compiler.size.cmd=avr-size
#mxusbstick.recipe.c.o.pattern="{compiler.path}{compiler.c.cmd}" {compiler.c.flags} -mmcu={build.mcu} -DF_CPU={build.f_cpu} -DARDUINO={runtime.ide.version} -DARDUINO_{build.board} -DARDUINO_ARCH_{build.arch}  {build.extra_flags} {includes} "{source_file}" -o "{object_file}"
#mxusbstick.recipe.cpp.o.pattern="{compiler.path}{compiler.cpp.cmd}" {compiler.cpp.flags} -mmcu={build.mcu} -DF_CPU={build.f_cpu} -DARDUINO={runtime.ide.version} -DARDUINO_{build.board} -DARDUINO_ARCH_{build.arch}  {build.extra_flags} {includes} "{source_file}" -o "{object_file}"
#mxusbstick.recipe.ar.pattern="{compiler.path}{compiler.ar.cmd}" {compiler.ar.flags} "{build.path}/{archive_file}" "{object_file}"
#mxusbstick.recipe.c.combine.pattern="{compiler.path}{compiler.c.elf.cmd}" {compiler.c.elf.flags} -mmcu={build.mcu} -o "{build.path}/{build.project_name}.elf" {object_files} "{build.path}/{archive_file}" "-L{build.path}" -lm
#mxusbstick.recipe.objcopy.eep.pattern="{compiler.path}{compiler.objcopy.cmd}" {compiler.objcopy.eep.flags} "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.eep"
#mxusbstick.recipe.objcopy.hex.pattern="{compiler.path}{compiler.elf2hex.cmd}" {compiler.elf2hex.flags} "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
#mxusbstick.recipe.size.pattern="{compiler.path}{compiler.size.cmd}" --format=avr --mcu={build.mcu} "{build.path}/{build.project_name}.elf"
#mxusbstick.recipe.size.regex=^(?:\.text|\.data|\.bootloader)\s+([0-9]+).*
#mxusbstick.recipe.size.regex.data=^(?:\.data|\.bss|\.noinit)\s+([0-9]+).*
#mxusbstick.recipe.size.regex.eeprom=^(?:\.eeprom)\s+([0-9]+).*
#mxusbstick.build.extra_flags=-DHAVE_STDINT_H -DRF230BB=1 -DUIP_CONF_IPV6=1 -DWATCHDOG_CONF_TIMEOUT=WDTO_8S -DAUTO_CRC_PADDING=2 -DAUTOSTART_ENABLE=1 -DPROJECT_CONF_H=\"project-conf.h\" -DCONTIKI=1 -DJACKDAW=1 -DAVRGCC=1 -DCONTIKI_TARGET_AVR_RAVENUSB=1
##############################################################
zigduino.name=contiki_zigduino
zigduino.cpu=atmega128rfa1

zigduino.upload.tool=avrdude
zigduino.upload.protocol=arduino
zigduino.upload.maximum_size=126976
zigduino.upload.speed=57600

zigduino.bootloader.tool=avrdude
zigduino.bootloader.low_fuses=0xFF
zigduino.bootloader.high_fuses=0xDA
zigduino.bootloader.extended_fuses=0xF5
zigduino.bootloader.file=atmega/ATmegaBOOT_atmega128rfa1_16M.hex
zigduino.bootloader.unlock_bits=0x3F
zigduino.bootloader.lock_bits=0x0F

zigduino.build.mcu=atmega128rfa1
zigduino.build.f_cpu=16000000L
zigduino.build.core=contiki
zigduino.build.variant=iduino
zigduino.compiler.path={runtime.ide.path}/tools/avr/bin/
zigduino.compiler.c.cmd=avr-gcc
zigduino.compiler.c.flags=-c -g -Os -w -ffunction-sections -fdata-sections -MMD -gdwarf-2 -fno-strict-aliasing  
zigduino.compiler.c.elf.flags=-Os -Wl,--gc-sections
zigduino.compiler.c.elf.cmd=avr-gcc
zigduino.compiler.S.flags=-c -g -assembler-with-cpp
zigduino.compiler.cpp.cmd=avr-g++
zigduino.compiler.cpp.flags=-c -g -Os -w -fno-exceptions -ffunction-sections -fdata-sections -MMD  -std=gnu++98  
zigduino.compiler.ar.cmd=avr-ar
zigduino.compiler.ar.flags=rcs
zigduino.compiler.objcopy.cmd=avr-objcopy
zigduino.compiler.objcopy.eep.flags=-O ihex -j .eeprom --set-section-flags=.eeprom=alloc,load --no-change-warnings --change-section-lma .eeprom=0
zigduino.compiler.elf2hex.flags=-O ihex -R .eeprom -j .text -j .data
zigduino.compiler.elf2hex.cmd=avr-objcopy
zigduino.compiler.ldflags=
zigduino.compiler.size.cmd=avr-size
zigduino.recipe.c.o.pattern="{compiler.path}{compiler.c.cmd}" {compiler.c.flags} -mmcu={build.mcu} -DF_CPU={build.f_cpu} -DARDUINO={runtime.ide.version} -DARDUINO_{build.board} -DARDUINO_ARCH_{build.arch}  {build.extra_flags} {includes} "{source_file}" -o "{object_file}"
zigduino.recipe.cpp.o.pattern="{compiler.path}{compiler.cpp.cmd}" {compiler.cpp.flags} -mmcu={build.mcu} -DF_CPU={build.f_cpu} -DARDUINO={runtime.ide.version} -DARDUINO_{build.board} -DARDUINO_ARCH_{build.arch}  {build.extra_flags} {includes} "{source_file}" -o "{object_file}"
zigduino.recipe.ar.pattern="{compiler.path}{compiler.ar.cmd}" {compiler.ar.flags} "{build.path}/{archive_file}" "{object_file}"
zigduino.recipe.c.combine.pattern="{compiler.path}{compiler.c.elf.cmd}" {compiler.c.elf.flags} -mmcu={build.mcu} -o "{build.path}/{build.project_name}.elf" {object_files} "{build.path}/{archive_file}" "-L{build.path}" -lm
zigduino.recipe.objcopy.eep.pattern="{compiler.path}{compiler.objcopy.cmd}" {compiler.objcopy.eep.flags} "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.eep"
zigduino.recipe.objcopy.hex.pattern="{compiler.path}{compiler.elf2hex.cmd}" {compiler.elf2hex.flags} "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
zigduino.recipe.size.pattern="{compiler.path}{compiler.size.cmd}" --format=avr --mcu={build.mcu} "{build.path}/{build.project_name}.elf"
zigduino.recipe.size.regex=^(?:\.text|\.data|\.bootloader)\s+([0-9]+).*
zigduino.recipe.size.regex.data=^(?:\.data|\.bss|\.noinit)\s+([0-9]+).*
zigduino.recipe.size.regex.eeprom=^(?:\.eeprom)\s+([0-9]+).*
zigduino.build.extra_flags=-DHAVE_STDINT_H -DRF230BB=1 -DUIP_CONF_IPV6=1 -DWATCHDOG_CONF_TIMEOUT=WDTO_8S -DAUTO_CRC_PADDING=2 -DAUTOSTART_ENABLE=1 -DPROJECT_CONF_H=\"project-conf.h\" -DCONTIKI=1 -DRS232_CONF_NUMPORTS=2 
